import os
from openai import OpenAI

API_KEY = '' # https://cloud.perfxlab.cn/ 

client = OpenAI(
    base_url='https://cloud.perfxlab.cn/v1',
    api_key= API_KEY
)
  
text = """```json
{
  "version": 1.2,
  "copywriting": [
    {
      "签": "関係運",
      "rank": 27,
      "参考": [
        "人运旺盛！扩展人脉吧",
        "能够拓展人际关系的一天，谨慎地与人交往吧",
        "与来之不易的伙伴颇有缘分",
      ]
    },
    {
      "签": "全体運",
      "rank": 26,
      "参考": [
        "身为领导者，连身边人的幸运都能提高的一天",
        "领导力将会被寄予厚望",
        "领导才华被认可的话 就一鼓作气吧！"
      ]
    },
    {
      "签": "勉強運",
      "rank": 25,
      "参考": [
        "把构思付诸实践试试看",
        "好像会对学习有兴趣，马上学习吧",
        "深化自己的教养便会更加好运",
      ]
    },
    {
      "签": "金運",
      "rank": 24,
      "参考": [
        "存款可能会大大增加",
        "意外之处出财运 可以轻松地行动",
        "财运顺畅，临时收入也可期待",
        "不管开了多贵的价都清下决心买入吧"
      ]
    },
    {
      "签": "仕事運",
      "rank": 23,
      "参考": [
        "即使想法被驳回也不要气馁！",
        "可能会有机会得到能增长自己见识的副业",
        "能够高效地完成工作 合作✘"
      ]
    },
    {
      "签": "恋愛運",
      "rank": 21,
      "参考": [
        "变得更加坚强 女性友人是幸运之匙",
        "被异性喜爱的一天 相信自己的魅力",
        "今天会备受异性瞩目 要注意仪容"
      ]
    },
    {
      "签": "総合運",
      "rank": 20,
      "参考": [
        "万事顺利的一天 麻利工作即是吉",
        "今日风调雨顺 做事干净利落即是吉",
        "单独行动会有好运 珍惜自己的热情"
      ]
    },
    {
      "签": "大吉",
      "rank": 10,
      "参考": [
        "寄全身于好奇心，世界将更加宽阔",
        "曾经的努力和经验会成为他人眼中魅力的样子",
        "被幽默感眷顾的一天，尽情的发言吧！",
        "大脑运转会快几倍！会是状态很好的一天！"
      ]
    },
    {
      "签": "中吉",
      "rank": 9,
      "参考": [
        "越出远门越能提高幸运值的日子",
        "会更受周围人士的期待，保持真诚",
        "能够挺过艰难险阻"
      ]
    },
    {
      "签": "小吉",
      "rank": 8,
      "参考": [
        "试试为了磨炼自己而花费时间",
        "在快乐当中提升自己修养的一天",
        "可能会想到革命性的点子"
      ]
    },
    {
      "签": "吉",
      "rank": 7,
      "参考": [
        "与人接触可丰富内心，亲切待人是幸运之钥",
        "越是凭直觉大胆行动越能加速进展的日子",
        "该拿出东西时就爽快的拿出手吧",
      ]
    },
    {
      "签": "半吉",

      "参考": [
        "匀出自由的时间，便能充实地度过",
        "不要吝啬交际支出",
        "充满幽默的一天 多多拿出自己的提案吧",
      ]
    },
    {
      "签": "末吉",
      "参考": [
        "用心做出冷静的判断则是吉",
        "珍惜私人时间明天才会更有活力",
        "现在正是好时机 赶紧进行先行投资吧"
      ]
    },
    {
      "签": "末小吉",
      "参考": [
        "在新环境里会有新机遇哦",
        "是能理解别人感受的一天，说些积极的话吧",
        "貌似有能够达成结果的机会",
        "看到就买吧 使用它的时候财运也会转回来"
      ]
    },
    {
      "签": "凶",
      "参考": [
        "去寻找能一见钟情的相遇比较好",
        "今天如果能好好听人说话就有希望",
        "即使想法被否决了也别灰心！",
        "事先进行细心的调查会提高成功率！"
      ]
    },
    {
      "签": "小凶",
      "参考": [
        "熟练之事也会犯低级错误？",
        "做惯了的工作会发生低级错误！？",
        "不要过于慷慨大方地乱花钱哦！",
        "储蓄不足的话要参考别人的建议",
      ]
    },
    {
      "签": "半凶",
      "参考": [
        "要注意自己的意见表达和大家步调一致",
        "要诚实诚恳地接受他人对你的信赖",
        "多考虑一下可以节约的部分",
      ]
    },
    {
      "签": "末凶",
      "参考": [
        "钱会往外跑，有计划地使用",
        "也许忍住购物欲会比较好",
        "试着说一说自己奇特的想法",
      ]
    },
    {
      "签": "大凶",
      "参考": [
        "心情变化剧烈的一天，深呼吸保持冷静",
        "表达意见的时候要注意尽量委婉地去表达吧",
        "战胜压力吧！",
        "今天意外地很难赚到钱呢",
      ]
    }
  ]
}
```

你的工作是收到一个【签】后，参考上诉的文本回复一个30字以内的建议，但请不要与上诉内容重复。
"""



def get_adv(fortune='吉'):
    
    assert API_KEY != '', '没有设置key 跳过'

    output = client.chat.completions.create(
    model="Llama3-Chinese_v2",
    messages=[
        {"role":"system","content":text},
        {"role":"user","content":"大吉"},
        {"role":"assistant","content":"有意义的工作会成为成长的关键"},
        {"role":"user","content":"大凶"},
        {"role":"assistant","content":"运势低迷 专注在自己的工作上吧"},
        {"role":"user","content":fortune}

    ],
    temperature=0.9,
    top_p=0.3,
    max_tokens=30,
    n=1,
    presence_penalty=0.5,
    frequency_penalty=0.5,

    )
    return output.choices[0].message.content